; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem roverprob2) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 rover1 - Rover
	rover0store rover1store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 waypoint10 waypoint11 waypoint12 waypoint13 waypoint14 waypoint15 waypoint16 waypoint17 waypoint18 waypoint19 - Waypoint
	camera0 camera1 camera2 camera3 - Camera
	objective0 objective1 objective2 objective3 - Objective
	)
(:init
	(visible waypoint0 waypoint10)
	(visible waypoint10 waypoint0)
	(visible waypoint0 waypoint15)
	(visible waypoint15 waypoint0)
	(visible waypoint0 waypoint17)
	(visible waypoint17 waypoint0)
	(visible waypoint1 waypoint2)
	(visible waypoint2 waypoint1)
	(visible waypoint1 waypoint16)
	(visible waypoint16 waypoint1)
	(visible waypoint2 waypoint0)
	(visible waypoint0 waypoint2)
	(visible waypoint2 waypoint11)
	(visible waypoint11 waypoint2)
	(visible waypoint2 waypoint13)
	(visible waypoint13 waypoint2)
	(visible waypoint2 waypoint19)
	(visible waypoint19 waypoint2)
	(visible waypoint3 waypoint11)
	(visible waypoint11 waypoint3)
	(visible waypoint3 waypoint12)
	(visible waypoint12 waypoint3)
	(visible waypoint3 waypoint15)
	(visible waypoint15 waypoint3)
	(visible waypoint4 waypoint6)
	(visible waypoint6 waypoint4)
	(visible waypoint4 waypoint7)
	(visible waypoint7 waypoint4)
	(visible waypoint5 waypoint1)
	(visible waypoint1 waypoint5)
	(visible waypoint5 waypoint2)
	(visible waypoint2 waypoint5)
	(visible waypoint5 waypoint4)
	(visible waypoint4 waypoint5)
	(visible waypoint5 waypoint11)
	(visible waypoint11 waypoint5)
	(visible waypoint5 waypoint13)
	(visible waypoint13 waypoint5)
	(visible waypoint5 waypoint14)
	(visible waypoint14 waypoint5)
	(visible waypoint6 waypoint1)
	(visible waypoint1 waypoint6)
	(visible waypoint6 waypoint7)
	(visible waypoint7 waypoint6)
	(visible waypoint6 waypoint8)
	(visible waypoint8 waypoint6)
	(visible waypoint6 waypoint15)
	(visible waypoint15 waypoint6)
	(visible waypoint6 waypoint19)
	(visible waypoint19 waypoint6)
	(visible waypoint7 waypoint10)
	(visible waypoint10 waypoint7)
	(visible waypoint7 waypoint11)
	(visible waypoint11 waypoint7)
	(visible waypoint7 waypoint17)
	(visible waypoint17 waypoint7)
	(visible waypoint7 waypoint19)
	(visible waypoint19 waypoint7)
	(visible waypoint8 waypoint2)
	(visible waypoint2 waypoint8)
	(visible waypoint8 waypoint9)
	(visible waypoint9 waypoint8)
	(visible waypoint8 waypoint15)
	(visible waypoint15 waypoint8)
	(visible waypoint8 waypoint16)
	(visible waypoint16 waypoint8)
	(visible waypoint9 waypoint4)
	(visible waypoint4 waypoint9)
	(visible waypoint9 waypoint17)
	(visible waypoint17 waypoint9)
	(visible waypoint11 waypoint6)
	(visible waypoint6 waypoint11)
	(visible waypoint11 waypoint10)
	(visible waypoint10 waypoint11)
	(visible waypoint11 waypoint12)
	(visible waypoint12 waypoint11)
	(visible waypoint12 waypoint2)
	(visible waypoint2 waypoint12)
	(visible waypoint12 waypoint4)
	(visible waypoint4 waypoint12)
	(visible waypoint12 waypoint16)
	(visible waypoint16 waypoint12)
	(visible waypoint13 waypoint1)
	(visible waypoint1 waypoint13)
	(visible waypoint13 waypoint6)
	(visible waypoint6 waypoint13)
	(visible waypoint13 waypoint11)
	(visible waypoint11 waypoint13)
	(visible waypoint13 waypoint12)
	(visible waypoint12 waypoint13)
	(visible waypoint13 waypoint15)
	(visible waypoint15 waypoint13)
	(visible waypoint14 waypoint2)
	(visible waypoint2 waypoint14)
	(visible waypoint14 waypoint11)
	(visible waypoint11 waypoint14)
	(visible waypoint14 waypoint13)
	(visible waypoint13 waypoint14)
	(visible waypoint14 waypoint16)
	(visible waypoint16 waypoint14)
	(visible waypoint15 waypoint1)
	(visible waypoint1 waypoint15)
	(visible waypoint15 waypoint10)
	(visible waypoint10 waypoint15)
	(visible waypoint15 waypoint14)
	(visible waypoint14 waypoint15)
	(visible waypoint16 waypoint0)
	(visible waypoint0 waypoint16)
	(visible waypoint16 waypoint3)
	(visible waypoint3 waypoint16)
	(visible waypoint16 waypoint5)
	(visible waypoint5 waypoint16)
	(visible waypoint16 waypoint9)
	(visible waypoint9 waypoint16)
	(visible waypoint17 waypoint6)
	(visible waypoint6 waypoint17)
	(visible waypoint17 waypoint14)
	(visible waypoint14 waypoint17)
	(visible waypoint17 waypoint18)
	(visible waypoint18 waypoint17)
	(visible waypoint18 waypoint1)
	(visible waypoint1 waypoint18)
	(visible waypoint18 waypoint2)
	(visible waypoint2 waypoint18)
	(visible waypoint18 waypoint4)
	(visible waypoint4 waypoint18)
	(visible waypoint18 waypoint7)
	(visible waypoint7 waypoint18)
	(visible waypoint18 waypoint11)
	(visible waypoint11 waypoint18)
	(visible waypoint18 waypoint12)
	(visible waypoint12 waypoint18)
	(visible waypoint18 waypoint13)
	(visible waypoint13 waypoint18)
	(visible waypoint19 waypoint5)
	(visible waypoint5 waypoint19)
	(visible waypoint19 waypoint11)
	(visible waypoint11 waypoint19)
	(visible waypoint19 waypoint13)
	(visible waypoint13 waypoint19)
	(visible waypoint19 waypoint15)
	(visible waypoint15 waypoint19)
	(at_rock_sample waypoint0)
	(at_soil_sample waypoint2)
	(at_soil_sample waypoint3)
	(at_rock_sample waypoint6)
	(at_rock_sample waypoint7)
	(at_soil_sample waypoint8)
	(at_rock_sample waypoint10)
	(at_soil_sample waypoint11)
	(at_rock_sample waypoint11)
	(at_rock_sample waypoint12)
	(at_soil_sample waypoint15)
	(at_rock_sample waypoint15)
	(at_soil_sample waypoint16)
	(at_rock_sample waypoint16)
	(at_rock_sample waypoint17)
	(at_soil_sample waypoint18)
	(at_rock_sample waypoint18)
	(at_rock_sample waypoint19)
	(at_lander general waypoint16)
	(channel_free general)
	(at rover0 waypoint16)
	(available rover0)
	(store_of rover0store rover0)
	(empty rover0store)
	(equipped_for_soil_analysis rover0)
	(equipped_for_imaging rover0)
	(can_traverse rover0 waypoint16 waypoint0)
	(can_traverse rover0 waypoint0 waypoint16)
	(can_traverse rover0 waypoint16 waypoint1)
	(can_traverse rover0 waypoint1 waypoint16)
	(can_traverse rover0 waypoint16 waypoint3)
	(can_traverse rover0 waypoint3 waypoint16)
	(can_traverse rover0 waypoint16 waypoint5)
	(can_traverse rover0 waypoint5 waypoint16)
	(can_traverse rover0 waypoint16 waypoint8)
	(can_traverse rover0 waypoint8 waypoint16)
	(can_traverse rover0 waypoint16 waypoint9)
	(can_traverse rover0 waypoint9 waypoint16)
	(can_traverse rover0 waypoint16 waypoint12)
	(can_traverse rover0 waypoint12 waypoint16)
	(can_traverse rover0 waypoint0 waypoint2)
	(can_traverse rover0 waypoint2 waypoint0)
	(can_traverse rover0 waypoint0 waypoint10)
	(can_traverse rover0 waypoint10 waypoint0)
	(can_traverse rover0 waypoint0 waypoint15)
	(can_traverse rover0 waypoint15 waypoint0)
	(can_traverse rover0 waypoint0 waypoint17)
	(can_traverse rover0 waypoint17 waypoint0)
	(can_traverse rover0 waypoint1 waypoint6)
	(can_traverse rover0 waypoint6 waypoint1)
	(can_traverse rover0 waypoint1 waypoint18)
	(can_traverse rover0 waypoint18 waypoint1)
	(can_traverse rover0 waypoint3 waypoint11)
	(can_traverse rover0 waypoint11 waypoint3)
	(can_traverse rover0 waypoint5 waypoint4)
	(can_traverse rover0 waypoint4 waypoint5)
	(can_traverse rover0 waypoint5 waypoint14)
	(can_traverse rover0 waypoint14 waypoint5)
	(can_traverse rover0 waypoint5 waypoint19)
	(can_traverse rover0 waypoint19 waypoint5)
	(can_traverse rover0 waypoint2 waypoint13)
	(can_traverse rover0 waypoint13 waypoint2)
	(at rover1 waypoint12)
	(available rover1)
	(store_of rover1store rover1)
	(empty rover1store)
	(equipped_for_soil_analysis rover1)
	(equipped_for_rock_analysis rover1)
	(equipped_for_imaging rover1)
	(can_traverse rover1 waypoint12 waypoint2)
	(can_traverse rover1 waypoint2 waypoint12)
	(can_traverse rover1 waypoint12 waypoint3)
	(can_traverse rover1 waypoint3 waypoint12)
	(can_traverse rover1 waypoint12 waypoint4)
	(can_traverse rover1 waypoint4 waypoint12)
	(can_traverse rover1 waypoint12 waypoint11)
	(can_traverse rover1 waypoint11 waypoint12)
	(can_traverse rover1 waypoint12 waypoint16)
	(can_traverse rover1 waypoint16 waypoint12)
	(can_traverse rover1 waypoint12 waypoint18)
	(can_traverse rover1 waypoint18 waypoint12)
	(can_traverse rover1 waypoint2 waypoint0)
	(can_traverse rover1 waypoint0 waypoint2)
	(can_traverse rover1 waypoint2 waypoint1)
	(can_traverse rover1 waypoint1 waypoint2)
	(can_traverse rover1 waypoint2 waypoint5)
	(can_traverse rover1 waypoint5 waypoint2)
	(can_traverse rover1 waypoint2 waypoint13)
	(can_traverse rover1 waypoint13 waypoint2)
	(can_traverse rover1 waypoint2 waypoint14)
	(can_traverse rover1 waypoint14 waypoint2)
	(can_traverse rover1 waypoint3 waypoint15)
	(can_traverse rover1 waypoint15 waypoint3)
	(can_traverse rover1 waypoint4 waypoint7)
	(can_traverse rover1 waypoint7 waypoint4)
	(can_traverse rover1 waypoint11 waypoint10)
	(can_traverse rover1 waypoint10 waypoint11)
	(can_traverse rover1 waypoint11 waypoint19)
	(can_traverse rover1 waypoint19 waypoint11)
	(can_traverse rover1 waypoint16 waypoint8)
	(can_traverse rover1 waypoint8 waypoint16)
	(can_traverse rover1 waypoint16 waypoint9)
	(can_traverse rover1 waypoint9 waypoint16)
	(can_traverse rover1 waypoint1 waypoint6)
	(can_traverse rover1 waypoint6 waypoint1)
	(can_traverse rover1 waypoint14 waypoint17)
	(can_traverse rover1 waypoint17 waypoint14)
	(on_board camera0 rover1)
	(calibration_target camera0 objective2)
	(supports camera0 high_res)
	(on_board camera1 rover0)
	(calibration_target camera1 objective0)
	(supports camera1 colour)
	(supports camera1 high_res)
	(on_board camera2 rover1)
	(calibration_target camera2 objective2)
	(supports camera2 high_res)
	(on_board camera3 rover1)
	(calibration_target camera3 objective2)
	(supports camera3 colour)
	(supports camera3 low_res)
	(visible_from objective0 waypoint1)
	(visible_from objective0 waypoint7)
	(visible_from objective0 waypoint10)
	(visible_from objective1 waypoint1)
	(visible_from objective1 waypoint3)
	(visible_from objective1 waypoint9)
	(visible_from objective1 waypoint10)
	(visible_from objective1 waypoint12)
	(visible_from objective1 waypoint15)
	(visible_from objective1 waypoint16)
	(visible_from objective1 waypoint18)
	(visible_from objective2 waypoint0)
	(visible_from objective2 waypoint1)
	(visible_from objective2 waypoint4)
	(visible_from objective2 waypoint5)
	(visible_from objective2 waypoint6)
	(visible_from objective2 waypoint10)
	(visible_from objective2 waypoint11)
	(visible_from objective2 waypoint12)
	(visible_from objective2 waypoint14)
	(visible_from objective2 waypoint17)
	(visible_from objective2 waypoint19)
	(visible_from objective3 waypoint0)
	(visible_from objective3 waypoint3)
	(visible_from objective3 waypoint12)
	(visible_from objective3 waypoint13)
	(visible_from objective3 waypoint15)
	(visible_from objective3 waypoint17)
)

(:goal (and
(communicated_soil_data waypoint18)
(communicated_soil_data waypoint16)
(communicated_soil_data waypoint8)
(communicated_soil_data waypoint11)
(communicated_soil_data waypoint3)
(communicated_soil_data waypoint2)
(communicated_soil_data waypoint15)
(communicated_rock_data waypoint11)
(communicated_rock_data waypoint16)
(communicated_rock_data waypoint19)
(communicated_rock_data waypoint7)
(communicated_rock_data waypoint0)
(communicated_rock_data waypoint17)
(communicated_image_data objective1 low_res)
(communicated_image_data objective1 high_res)
(communicated_image_data objective2 low_res)
	)
)
)

; plan
1. (calibrate rover1 camera0 objective2 waypoint12)
   added: (calibrated camera0 rover1)
   goals met: 0 of 16
2. (calibrate rover1 camera3 objective2 waypoint12)
   added: (calibrated camera3 rover1)
   goals met: 0 of 16
3. (take_image rover1 waypoint12 objective1 camera0 high_res)
   deleted: (calibrated camera0 rover1)
   added: (have_image rover1 objective1 high_res)
   goals met: 0 of 16
4. (communicate_image_data rover1 general objective1 high_res waypoint12 waypoint16)
   added: (communicated_image_data objective1 high_res)
   goals met: 1 of 16
5. (navigate rover0 waypoint16 waypoint8)
   deleted: (at rover0 waypoint16)
   added: (at rover0 waypoint8)
   goals met: 1 of 16
6. (sample_soil rover0 rover0store waypoint8)
   deleted: (empty rover0store) (at_soil_sample waypoint8)
   added: (have_soil_analysis rover0 waypoint8) (full rover0store)
   goals met: 1 of 16
7. (communicate_soil_data rover0 general waypoint8 waypoint8 waypoint16)
   added: (communicated_soil_data waypoint8)
   goals met: 2 of 16
8. (take_image rover1 waypoint12 objective1 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective1 low_res)
   goals met: 2 of 16
9. (calibrate rover1 camera3 objective2 waypoint12)
   added: (calibrated camera3 rover1)
   goals met: 2 of 16
10. (take_image rover1 waypoint12 objective2 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective2 low_res)
   goals met: 2 of 16
11. (communicate_image_data rover1 general objective2 low_res waypoint12 waypoint16)
   added: (communicated_image_data objective2 low_res)
   goals met: 3 of 16
12. (communicate_image_data rover1 general objective1 low_res waypoint12 waypoint16)
   added: (communicated_image_data objective1 low_res)
   goals met: 4 of 16
13. (navigate rover1 waypoint12 waypoint3)
   deleted: (at rover1 waypoint12)
   added: (at rover1 waypoint3)
   goals met: 4 of 16
14. (sample_soil rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_soil_sample waypoint3)
   added: (have_soil_analysis rover1 waypoint3) (full rover1store)
   goals met: 4 of 16
15. (navigate rover1 waypoint3 waypoint12)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint12)
   goals met: 4 of 16
16. (communicate_soil_data rover1 general waypoint3 waypoint12 waypoint16)
   added: (communicated_soil_data waypoint3)
   goals met: 5 of 16
17. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 5 of 16
18. (navigate rover1 waypoint12 waypoint11)
   deleted: (at rover1 waypoint12)
   added: (at rover1 waypoint11)
   goals met: 5 of 16
19. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 5 of 16
20. (navigate rover0 waypoint8 waypoint16)
   deleted: (at rover0 waypoint8)
   added: (at rover0 waypoint16)
   goals met: 5 of 16
21. (sample_soil rover0 rover0store waypoint16)
   deleted: (empty rover0store) (at_soil_sample waypoint16)
   added: (have_soil_analysis rover0 waypoint16) (full rover0store)
   goals met: 5 of 16
22. (navigate rover0 waypoint16 waypoint9)
   deleted: (at rover0 waypoint16)
   added: (at rover0 waypoint9)
   goals met: 5 of 16
23. (communicate_soil_data rover0 general waypoint16 waypoint9 waypoint16)
   added: (communicated_soil_data waypoint16)
   goals met: 6 of 16
24. (sample_rock rover1 rover1store waypoint11)
   deleted: (empty rover1store) (at_rock_sample waypoint11)
   added: (have_rock_analysis rover1 waypoint11) (full rover1store)
   goals met: 6 of 16
25. (navigate rover1 waypoint11 waypoint12)
   deleted: (at rover1 waypoint11)
   added: (at rover1 waypoint12)
   goals met: 6 of 16
26. (communicate_rock_data rover1 general waypoint11 waypoint12 waypoint16)
   added: (communicated_rock_data waypoint11)
   goals met: 7 of 16
27. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 7 of 16
28. (navigate rover1 waypoint12 waypoint11)
   deleted: (at rover1 waypoint12)
   added: (at rover1 waypoint11)
   goals met: 7 of 16
29. (sample_soil rover1 rover1store waypoint11)
   deleted: (empty rover1store) (at_soil_sample waypoint11)
   added: (have_soil_analysis rover1 waypoint11) (full rover1store)
   goals met: 7 of 16
30. (navigate rover1 waypoint11 waypoint12)
   deleted: (at rover1 waypoint11)
   added: (at rover1 waypoint12)
   goals met: 7 of 16
31. (communicate_soil_data rover1 general waypoint11 waypoint12 waypoint16)
   added: (communicated_soil_data waypoint11)
   goals met: 8 of 16
32. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 8 of 16
33. (navigate rover1 waypoint12 waypoint18)
   deleted: (at rover1 waypoint12)
   added: (at rover1 waypoint18)
   goals met: 8 of 16
34. (sample_soil rover1 rover1store waypoint18)
   deleted: (empty rover1store) (at_soil_sample waypoint18)
   added: (have_soil_analysis rover1 waypoint18) (full rover1store)
   goals met: 8 of 16
35. (navigate rover1 waypoint18 waypoint12)
   deleted: (at rover1 waypoint18)
   added: (at rover1 waypoint12)
   goals met: 8 of 16
36. (communicate_soil_data rover1 general waypoint18 waypoint12 waypoint16)
   added: (communicated_soil_data waypoint18)
   goals met: 9 of 16
37. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 9 of 16
38. (navigate rover1 waypoint12 waypoint2)
   deleted: (at rover1 waypoint12)
   added: (at rover1 waypoint2)
   goals met: 9 of 16
39. (navigate rover1 waypoint2 waypoint0)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint0)
   goals met: 9 of 16
40. (sample_rock rover1 rover1store waypoint0)
   deleted: (empty rover1store) (at_rock_sample waypoint0)
   added: (have_rock_analysis rover1 waypoint0) (full rover1store)
   goals met: 9 of 16
41. (communicate_rock_data rover1 general waypoint0 waypoint0 waypoint16)
   added: (communicated_rock_data waypoint0)
   goals met: 10 of 16
42. (navigate rover0 waypoint9 waypoint16)
   deleted: (at rover0 waypoint9)
   added: (at rover0 waypoint16)
   goals met: 10 of 16
43. (navigate rover0 waypoint16 waypoint0)
   deleted: (at rover0 waypoint16)
   added: (at rover0 waypoint0)
   goals met: 10 of 16
44. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 10 of 16
45. (navigate rover0 waypoint0 waypoint15)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint15)
   goals met: 10 of 16
46. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 10 of 16
47. (sample_soil rover0 rover0store waypoint15)
   deleted: (empty rover0store) (at_soil_sample waypoint15)
   added: (have_soil_analysis rover0 waypoint15) (full rover0store)
   goals met: 10 of 16
48. (navigate rover0 waypoint15 waypoint0)
   deleted: (at rover0 waypoint15)
   added: (at rover0 waypoint0)
   goals met: 10 of 16
49. (communicate_soil_data rover0 general waypoint15 waypoint0 waypoint16)
   added: (communicated_soil_data waypoint15)
   goals met: 11 of 16
50. (navigate rover1 waypoint0 waypoint2)
   deleted: (at rover1 waypoint0)
   added: (at rover1 waypoint2)
   goals met: 11 of 16
51. (navigate rover1 waypoint2 waypoint12)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint12)
   goals met: 11 of 16
52. (navigate rover1 waypoint12 waypoint11)
   deleted: (at rover1 waypoint12)
   added: (at rover1 waypoint11)
   goals met: 11 of 16
53. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 11 of 16
54. (navigate rover0 waypoint0 waypoint2)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint2)
   goals met: 11 of 16
55. (sample_soil rover0 rover0store waypoint2)
   deleted: (empty rover0store) (at_soil_sample waypoint2)
   added: (have_soil_analysis rover0 waypoint2) (full rover0store)
   goals met: 11 of 16
56. (navigate rover0 waypoint2 waypoint0)
   deleted: (at rover0 waypoint2)
   added: (at rover0 waypoint0)
   goals met: 11 of 16
57. (communicate_soil_data rover0 general waypoint2 waypoint0 waypoint16)
   added: (communicated_soil_data waypoint2)
   goals met: 12 of 16
58. (navigate rover1 waypoint11 waypoint19)
   deleted: (at rover1 waypoint11)
   added: (at rover1 waypoint19)
   goals met: 12 of 16
59. (sample_rock rover1 rover1store waypoint19)
   deleted: (empty rover1store) (at_rock_sample waypoint19)
   added: (have_rock_analysis rover1 waypoint19) (full rover1store)
   goals met: 12 of 16
60. (navigate rover1 waypoint19 waypoint11)
   deleted: (at rover1 waypoint19)
   added: (at rover1 waypoint11)
   goals met: 12 of 16
61. (navigate rover1 waypoint11 waypoint12)
   deleted: (at rover1 waypoint11)
   added: (at rover1 waypoint12)
   goals met: 12 of 16
62. (communicate_rock_data rover1 general waypoint19 waypoint12 waypoint16)
   added: (communicated_rock_data waypoint19)
   goals met: 13 of 16
63. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 13 of 16
64. (navigate rover1 waypoint12 waypoint4)
   deleted: (at rover1 waypoint12)
   added: (at rover1 waypoint4)
   goals met: 13 of 16
65. (navigate rover1 waypoint4 waypoint7)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint7)
   goals met: 13 of 16
66. (sample_rock rover1 rover1store waypoint7)
   deleted: (empty rover1store) (at_rock_sample waypoint7)
   added: (have_rock_analysis rover1 waypoint7) (full rover1store)
   goals met: 13 of 16
67. (navigate rover1 waypoint7 waypoint4)
   deleted: (at rover1 waypoint7)
   added: (at rover1 waypoint4)
   goals met: 13 of 16
68. (navigate rover1 waypoint4 waypoint12)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint12)
   goals met: 13 of 16
69. (communicate_rock_data rover1 general waypoint7 waypoint12 waypoint16)
   added: (communicated_rock_data waypoint7)
   goals met: 14 of 16
70. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 14 of 16
71. (navigate rover1 waypoint12 waypoint2)
   deleted: (at rover1 waypoint12)
   added: (at rover1 waypoint2)
   goals met: 14 of 16
72. (navigate rover1 waypoint2 waypoint14)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint14)
   goals met: 14 of 16
73. (navigate rover1 waypoint14 waypoint17)
   deleted: (at rover1 waypoint14)
   added: (at rover1 waypoint17)
   goals met: 14 of 16
74. (sample_rock rover1 rover1store waypoint17)
   deleted: (empty rover1store) (at_rock_sample waypoint17)
   added: (have_rock_analysis rover1 waypoint17) (full rover1store)
   goals met: 14 of 16
75. (navigate rover1 waypoint17 waypoint14)
   deleted: (at rover1 waypoint17)
   added: (at rover1 waypoint14)
   goals met: 14 of 16
76. (communicate_rock_data rover1 general waypoint17 waypoint14 waypoint16)
   added: (communicated_rock_data waypoint17)
   goals met: 15 of 16
77. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 15 of 16
78. (navigate rover1 waypoint14 waypoint2)
   deleted: (at rover1 waypoint14)
   added: (at rover1 waypoint2)
   goals met: 15 of 16
79. (navigate rover1 waypoint2 waypoint12)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint12)
   goals met: 15 of 16
80. (navigate rover1 waypoint12 waypoint16)
   deleted: (at rover1 waypoint12)
   added: (at rover1 waypoint16)
   goals met: 15 of 16
81. (sample_rock rover1 rover1store waypoint16)
   deleted: (empty rover1store) (at_rock_sample waypoint16)
   added: (have_rock_analysis rover1 waypoint16) (full rover1store)
   goals met: 15 of 16
82. (navigate rover1 waypoint16 waypoint9)
   deleted: (at rover1 waypoint16)
   added: (at rover1 waypoint9)
   goals met: 15 of 16
83. (communicate_rock_data rover1 general waypoint16 waypoint9 waypoint16)
   added: (communicated_rock_data waypoint16)
   goals met: 16 of 16
